/* ********************************************************
¿À¶óÅ¬ Á¤±Ô½Ä(Á¤±ÔÇ¥Çö½Ä) ÇÔ¼ö »ç¿ë

- Á¤±ÔÇ¥Çö½Ä(regular expression, regexp):  
    - ÆĞÅÏÀ» °¡Áø ¹®ÀÚ¿­À» Ç¥ÇöÇÒ¶§ »ç¿ëÇÏ´Â Çü½Ä ¾ğ¾î.
    - ¹®ÀÚ¿­ ³»¿¡¼­ Æ¯Á¤ ÆĞÅÏÀÇ ¹®ÀÚ¿­À» Ã£À» ¶§ ÁÖ·Î »ç¿ë 
	- Ç¥Çö½Ä¿¡¼­ »ç¿ëÇÏ´Â ¹®ÀÚ
		- ¸ŞÅ¸(Meta)¹®ÀÚ: ÆĞÅÏÀ» Ç¥ÇöÇÏ´Â ¹®ÀÚ.
		- ¸®ÅÍ·²(Literal) ¹®ÀÚ: Ç¥Çö½Ä ÀÚÃ¼°¡ °ª.
		
- ¿À¶óÅ¬ 10g ºÎÅÍ Á¤±Ô½ÄÀ» Áö¿øÇÏ´Â ÇÔ¼ö¸¦ Á¦°ø.
    - regexp_like()
    - regexp_substr()
    - regexp_replace()
    - regexp_count()
    
    
- ÆĞÅÏ¿¡¼­ »ç¿ëÇÏ´Â ¸ŞÅ¸¹®ÀÚ µé
- ÀÏÄ¡ÇÏ´Â ¹®ÀÚ ¹İº¹ °³¼ö °ü·Ã
    * : ¾ÕÀÇ ¹®ÀÚ(ÆĞÅÏ)°ú ÀÏÄ¡ÇÏ´Â ¹®ÀÚ°¡ 0°³ ÀÌ»óÀÎ °æ¿ì. ('Ab*') >>A, Ab, Abb, Abb...
    + : ¾ÕÀÇ ¹®ÀÚ(ÆĞÅÏ)°ú ÀÏÄ¡ÇÏ´Â ¹®ÀÚ°¡ 1°³ÀÌ»óÀÎ °æ¿ì.  ('Ab+') >>Ab, Abb, Abb....
    ? : ¾ÕÀÇ ¹®ÀÚ(ÆĞÅÏ)°ú ÀÏÄ¡ÇÏ´Â ¹®ÀÚ°¡ ÇÑ°³ ÀÖ°Å³ª ¾ø´Â °æ¿ì. ('A?b') >>b, Ab
    . : ¾î¶² ±ÛÀÚ´øÁö ÇÑ±ÛÀÚ ¿Í¾ßÇÑ´Ù. ('A.B') >>AaB, AbB, ...
    {m} : ¾ÕÀÇ ¹®ÀÚ(ÆĞÅÏ)°¡ m°³. ('a{3}') >>aaa
    {m, } : ¾ÕÀÇ ¹®ÀÚ(ÆĞÅÏ)ÀÌ m°³ ÀÌ»ó. ('a{3, }') >>aaa, aaaa, aaaaa...
    {m, n} : ¾ÕÀÇ ¹®ÀÚ(ÆĞÅÏ)ÀÌ m°³ÀÌ»ó n°³ ÀÌÇÏ. ('a{2, 5}') >>aa, aaa, aaaa, aaaaa
    
- ¹®ÀåÀÇ ½ÃÀÛ°ú ³¡ Ç¥Çö
    ^ : ¹®ÀÚ¿­ÀÇ ½ÃÀÛÀ» ÀÇ¹Ì. ('^abc') >>abc·Î ½ÃÀÛ
    $ : ¹®ÀÚ¿­ÀÇ ³¡À» ÀÇ¹Ì ('abc$') >>abc·Î ³¡

- Æ¯Á¤ Å¬·¡½º ÁöÁ¤ 
    - [ ÆĞÅÏ ] : Å¬·¡½º  
        - [ ] »çÀÌÀÇ ¹®ÀÚµéÁß ÇÏ³ª¿Í ÀÏÄ¡ÇÏ´Â °Í.  
        - "-"¿Í °°ÀÌ ¾²¸é ¹üÀ§·Î ÁöÁ¤ °¡´É
        - [^  ] : ¹®ÀÚ Å¬·¡½º°¡ "^" ·Î ½ÃÀÛ ÇÏ¸é ÀÏÄ¡ÇÏÁö ¾Ê´Â °ÍÀÌ µÈ´Ù.
        - A[abc]>>Aa, Ab, Ac
          A[abc]*>>Aaa, Aabba, Aabc
          [a-zA-Z]>>aZ ¼Ò¹®ÀÚ ÇÏ³ª ´ë¹®ÀÚ ÇÏ³ª
          [°¡-°²]>>¤¡ÀÌ µé¾î°¡´Â ¸ğµç ±ÛÀÚ
          [°¡-ÆR]>>ÇÑ±ÛÀüÃ¼ Áß ¾Æ¹«°Å³ª
          [0-9]>>0¿¡¼­ 9»çÀÌ ¼ıÀÚ
- [: Å¬·¡½º¸í :] : ¹Ì¸® ÁöÁ¤µÈ Å¬·¡½º »ç¿ë
    - [:alpha:] ¶Ç´Â \a : ¾ËÆÄºª ¹®ÀÚ (\A´Â ¾ËÆÄºª¸¦ Á¦¿ÜÇÑ ¸ğµç ¹®ÀÚ ÇÏ³ª)   
    - [:digit:] ¶Ç´Â \d : ¼ıÀÚ  (\D´Â ¼ıÀÚ¸¦ Á¦¿ÜÇÑ ¸ğµç¹®ÀÚ)
    - [:lower:] : ¼Ò¹®ÀÚ ¾ËÆÄºª ¹®ÀÚ    [:upper:] : ´ë¹®ÀÚ ¾ËÆÄºª ¹®ÀÚ
    - [:alnum:] : ¶Ç´Â \w : ¾ËÆÄºª¹®ÀÚ¿Í ¼ıÀÚ   (\W : ¼ıÀÚ¿Í ¹®ÀÚ¸¦ Á¦¿ÜÇÑ ¸ğµç ¹®ÀÚ(Æ¯¼ö¹®ÀÚ, °ø¹é µî))
    - [:space:] : °ø¹é ¹®ÀÚ  ¶Ç´Â \s.  \S: °ø¹éÀ» Á¦¿ÜÇÑ ¸ğµç ¹®ÀÚ
    - [:punct:] : Æ¯¼ö ¹®ÀÚµé ($,\...)
- ±âÅ¸
    - |  : ¼±ÅÃ (010|011) orÀÇ ÀÇ¹Ì
    -\¸ŞÅ¸¹®ÀÚ : ¸ŞÅ¸¹®ÀÚ¸¦ ÆĞÅÏ¿¡ »ç¿ëÇÒ °æ¿ì ¾Õ¿¡ \¸¦ ºÙÀÎ´Ù. (\. ) ex)\\d
    -( ) : ½ÄÀ» ¹­À»¶§ »ç¿ë.(ÆĞÅÏ³»¿¡ ÇÏÀ§ÆĞÅÏÀ» ¸¸µç´Ù)  ex) a(b|c)d
        - ( ) ·Î ¹­ÀÎ ÆĞÅÏÀº \¼ø¹ø  À¸·Î È£Ãâ ÇÒ ¼ö ÀÖ´Ù.
            - ex:   'a(b|c)d\1'  ´Â 'a(b|c)d(b|c)' ¿Í µ¿ÀÏ

******************************************************** */


--¿¹Á¦Å×ÀÌºí
drop table regexp_exam;
create table regexp_exam(
 no number primary key,
 phone varchar(30), 
 email varchar(50)
);

insert into regexp_exam values(1, '010-352-1029', 'aaa@daum.net');
insert into regexp_exam values(2, '010-551-3011', 'bbbb@naver.net');
insert into regexp_exam values(3, '02-8761-9200', 'ab.cde@naver.net');
insert into regexp_exam values(4, '031-5432-5432', 'cccc@daum.net');
insert into regexp_exam values(5, '010-5322-1321', 'dd@daum.net');
insert into regexp_exam values(6, '019-3333-3333', 'test123@outook.kr');
insert into regexp_exam values(7, '016-4631-2139', 'qwer@gmail.com');
insert into regexp_exam values(8, '016-532-0100', 'oiuy@daum.net');
insert into regexp_exam values(9, '051-3210-2011', 'ujnhy@outook.kr');
insert into regexp_exam values(10, '010-4113-9300', 'ounae@daum.net');
insert into regexp_exam values(11, '011-5131-8040', 'abc123@gmail.com');
insert into regexp_exam values(12, '010-812-0012', 'my.email@gmail.com');
insert into regexp_exam values(13, '011-912-2167', 'test.addr@daum.net');
commit;
select * from regexp_exam;

/* ***************************************************************
regexp_like(Á¶È¸¹®ÀÚ¿­, ÆĞÅÏ [, ¿É¼Ç])
- like ¿¬»êÀÚÀÇ È®Àå
- where Àı¿¡¼­ »ç¿ëÇÏ¸ç ÆĞÅÏ°ú ¸ÅÄª µÇ´Â ¹®ÀÚ¿­ÀÌ Á¶È¸¹®ÀÚ¿­¾È¿¡ ÀÖ´Â Áö È®ÀÎ.
- ¿É¼Ç: c (´ë¼Ò¹®ÀÚ ±¸ºĞ)-±âº»°ªdefault, i (´ë¼Ò¹®ÀÚ±¸ºĞ¾ÈÇÔ)
*************************************************************** */
--ÀüÈ­¹øÈ£°¡ 011 ¶Ç´Â 010ÀÎ ÇàÀ» Á¶È¸
select * from regexp_exam
where regexp_like(phone, '^01(1|0)'); --^: ½ÃÀÛ, 01 1 ¶Ç´Â 0
--where regexp_like(phone, '^01[01]'); -- 01·Î ½ÃÀÛ, 0¶Ç´Â 1


--ÇÚµåÆù ¹øÈ£ÀÎ ÇàÀ» Á¶È¸ (010, 011, 016, 017, 018, 019)·Î ½ÃÀÛÇÏ´Â ¹øÈ£
select * from regexp_exam
where regexp_like(phone, '^01[016789]'); -- 01·Î ½ÃÀÛ, 0|1|6|7|8|9 Áß ÇÏ³ª


-- ±¹¹øÀÌ 3ÀÚ¸®ÀÎ ÇàÀ» Á¶È¸
select * from regexp_exam
where regexp_like(phone, '-\d{3}-'); --\d: ¼ıÀÚ 1°³ ,  {3}: 3°³, ¾çÂÊ¿¡ -(´ë½Ã)°¡ µé¾î¿È


--ÀüÈ­¹øÈ£ÀÇ ±¹¹ø(2¹øÂ°)°ú ¹øÈ£(3¹øÂ°)°¡ °°Àº °Í
select * from regexp_exam
where regexp_like(phone, '-(\d+)-\1'); --(\d+): ÆĞÅÏ³»ÀÇ ÇÏÀ§±×·ì. \d{3,4}: ¼ıÀÚ°¡ 3°³³ª 4°³¿Â´Ù. \1: 1¹ø ÆĞÅÏÀÇ °ª°ú µ¿ÀÏÇÏ´Ù.


--ÀÌ¸ŞÀÏÁÖ¼Ò °èÁ¤ ºÎºĞ(@ ¾Õ)¿¡ . ÀÌ ¾ø´Â Çàµé Á¶È¸
select * from regexp_exam
where not regexp_like(email,'\w+\.\w+@');  --\w:¹®ÀÚ(¼ıÀÚ,¾ËÆÄºª) ÇÏ³ª +1±ÛÀÚÀÌ»ó
--1±ÛÀÚÀÌ»óÀÇ¹®ÀÚ.1±ÛÀÚÀÌ»óÀÇ¹®ÀÚ@
--¸ŞÅ¸¹®ÀÚ .: ÀÓÀÇÀÇ 1±ÛÀÚ





/* *************************************************************************
regexp_substr(´ë»ó, ÆĞÅÏ [, Ã£±â½ÃÀÛindex, ¸î¹øÂ°°Í, ¿É¼Ç])
    - substr() ÇÔ¼öÀÇ È®Àå
    - ´ë»ó¹®ÀÚ¿­¿¡¼­ ÆĞÅÏ°ú ÀÏÄ¡ÇÏ´Â ¹®ÀÚ¿­À» ¹İÈ¯ÇÑ´Ù.
    - Ã£±â ½ÃÀÛ index: ÆĞÅÏ°ú ÀÏÄ¡ÇÏ´Â ¹®ÀÚ¿­À» Ã£±â ½ÃÀÛÇÏ´Â ±ÛÀÚ À§Ä¡ (±âº»°ª : 1)
    - ¸î¹øÂ°°Í: ÆĞÅÏ°ú ÀÏÄ¡ÇÏ´Â ¹®ÀÚ¿­ÀÌ ¿©·¯°³ÀÏ¶§ ¸î¹øÂ° °ÍÀÎÁö ÁöÁ¤ (±âº»°ª : 1)
************************************************************************* */
--ÀÌ¸ŞÀÏ ÁÖ¼ÒÀÇ @ ¾ÕÀÇ ºÎºĞ/µŞºÎºĞ¸¸ Ãâ·Â
select regexp_substr(email, '[^@]+') "@¾Õ" ,regexp_substr(email, '[^@]+',1,2)"@µÚ" --ÆĞÅÏ°ú ÀÏÄ¡ÇÏ´Â °Í Áß 2¹øÂ° °Í.
from regexp_exam;

select regexp_substr(email, '[^@]*') "@¾Õ" ,regexp_substr(email, '[^@]*',1,2) "@µÚ", regexp_substr(email, '[^@]*',1,3) 
from regexp_exam;

select email from regexp_exam;


--ÀüÈ­¹øÈ£ÀÇ Ã¹¹øÂ°ºÎºĞ(Åë½Å¸Á/Áö¿ª¹øÈ£) ¸¸  ÃßÃâÇØ¼­ Ãâ·Â
select regexp_substr(phone, '\d+')"Ã¹¹øÂ°ºÎºĞ", regexp_substr(phone, '\d+',1,2)"µÎ¹øÂ°ºÎºĞ",regexp_substr(phone, '\d+',1,3)"¼¼¹øÂ°ºÎºĞ" 
--ÀüÈ­¹øÈ£ ¾ÕÀÚ¸®, Áß°£ÀÚ¸®, ¸¶Áö¸·ÀÚ¸® ¼ø
from regexp_exam;


--±¹¹ø¸¸ ÃßÃâÇØ¼­ Ãâ·Â
select regexp_substr(phone, '\d+',1,2)"µÎ¹øÂ°ºÎºĞ"
from regexp_exam;



--°³º°¹øÈ£¸¸ ÃßÃâÇØ¼­ Ãâ·Â
select regexp_substr(phone, '\d+',1,3)"¼¼¹øÂ°ºÎºĞ"
from regexp_exam;




/* *************************************************************************
regexp_replace(´ë»ó, ÆĞÅÏ, º¯°æÇÒ¹®ÀÚ¿­ [, Ã£±â½ÃÀÛidex, ¸î¹øÂ°°Í, ¿É¼Ç])
    - replace() ÇÔ¼öÀÇ È®Àå
    - ´ë»ó¹®ÀÚ¿­¿¡¼­ ÆĞÅÏ°ú ÀÏÄ¡ÇÏ´Â ¹®ÀÚ¿­À» ¹İÈ¯ÇÑ´Ù.

************************************************************************* */
-- ÀüÈ­¹øÈ£ÀÇ ±¹¹øÀ» * ·Î ¹Ù²ã¼­ Ãâ·Â
select  phone, regexp_replace(phone, '\d+', '****', 1, 2)
from    regexp_exam;


-- ÀüÈ­¹øÈ£ÀÇ ¹øÈ£(¸¶Áö¸· ºÎºĞ)À» ****·Î ¹Ù²ã¼­ Ãâ·Â
select  phone, regexp_replace(phone, '\d+', '****', 1, 3)
from    regexp_exam;


/* ******************************************
regexp_count(´ë»ó, ÆĞÅÏ [, ½ÃÀÛindex] [, ¿É¼Ç]) 
 - ´ë»ó¿¡¼­ ÆĞÅÏÀÌ ³ªÅ¸³­ È½¼ö¸¦ ¹İÈ¯ÇÑ´Ù.

****************************************** */
-- ÀüÈ­¹øÈ£¿¡¼­ ¼ıÀÚµéÀÇ °³¼ö¸¦ Á¶È¸ 
select regexp_count(phone, '\d')
from regexp_exam;


